<template>
  <div class="app-document">
    <section class="head">
      <table class="head-table">
        <tr>
          <td>
            <p>«Согласовано» с Управляющим советом от ____20____г</p>
            <p>Председатель УС: _______ {{ fullName }} подпись</p>
          </td>
          <td>
            <p>«Утверждено» приказом от ____20____г №_______</p>
            <p>Должность: <input type="text" v-model="position" /></p>
          </td>
        </tr>
      </table>
    </section>

    <section>
      <h1>
        ПОЛОЖЕНИЕ о разработке и реализации специальной индивидуальной программы
        развития обучающегося
      </h1>
    </section>

    <section>
      <h2>I. Цель и основание разработки и реализации СИПР</h2>

      <ol start="1">
        <li>
          Широкий диапазон особых образовательных потребностей детей с
          умеренной, тяжелой, глубокой умственной отсталостью, с ТМНР вызывает
          необходимость образования таких обучающихся по индивидуальной
          программе.
        </li>
        <li>
          В соответствии с требованиями ФГОС образования обучающихся с
          интеллектуальными нарушениями и с учетом 2 варианта примерной АООП
          образования обучающихся с интеллектуальными нарушениями
          образовательная организация разрабатывает специальную индивидуальную
          программу развития (далее СИПР) под руководством {{ fullName }} в
          должности {{ position }}.
        </li>
        <li>
          Целью реализации СИПР является обретение обучающимся таких жизненных
          компетенций, которые позволяют ему достигать максимально возможной
          самостоятельности в решении повседневных жизненных задач, обеспечивают
          его включение в жизнь общества на основе индивидуального поэтапного,
          планомерного расширения жизненного опыта и повседневных социальных
          контактов в доступных для него пределах.
        </li>
      </ol>
    </section>

    <section>
      <h1>II. Организация разработки СИПР</h1>
      <ol start="2">
        <li>
          При поступлении ребенка в образовательную организацию специалисты
          проводят психолого-педагогическое обследование с целью последующей
          разработки СИПР и создания оптимальных условий ее реализации.
        </li>
        <li>
          На основе результатов психолого-педагогического обследования ребенка,
          проводимого специалистами образовательной организации, составляется
          психолого-педагогическая характеристика ребенка, в которой дается
          оценка его актуального состояния развития и определяется зона
          ближайшего развития обучающегося.
        </li>
        <li>
          Структура характеристики включает:
          <ul>
            <li v-for="item in valueOne" :key="item.id">
              <input
                type="checkbox"
                :name="item.id"
                :value="item.id"
                :id="item.id"
                v-model="checkedValueOne"
              />{{ item.text }}
            </li>
          </ul>
        </li>
        <li>
          Программа сотрудничества специалистов с семьей обучающегося включает
          перечень направлений сотрудничества, мероприятий и форм сотрудничества
          организации и семьи обучающегося, а также частоту и сроки проведения
          мероприятий. Программа сотрудничества специалистов с семьей
          обучающегося предусматривает:
          <ul>
            <li v-for="item in valueTwo" :key="item.id">
              <input
                type="radio"
                :name="item.id"
                :id="item.id"
                :value="item.id"
                v-model="checkedValueTwo"
              />
              <label :for="item.id">{{ item.text }}</label>
            </li>
          </ul>
        </li>
      </ol>
    </section>

    <section>
      <h2>III. Организация реализации СИПР</h2>
      <ol>
        <li>
          Реализация СИПР осуществляется группой, в которую входят те же
          специалисты, которые разрабатывали индивидуальную программу развития,
          и родителями (законными представителями) обучающегося.
        </li>
        <li>
          К анализу результатов обучения привлекаются члены семьи обучающегося.
          В ходе аттестации дается согласованная оценка достижений ребёнка в
          сфере жизненных компетенций.
        </li>
      </ol>
    </section>
    <section>
      <table class="table">
        <tr>
          <td>Критерии</td>
          <td>Параметры</td>
          <td>Индикаторы</td>
        </tr>
        <tr>
          <td rowspan="9">
            Овладение социально - бытовыми умениями, используемыми в
            повседневной жизни
          </td>
          <td rowspan="3">
            Сформированность социально-бытовых умений в домашних условиях
          </td>
          <td>
            Способность применять социально бытовые умения под руководством
            взрослого
          </td>
        </tr>
        <tr>
          <td>
            Способность обращаться за помощью при формировании социально-бытовых
            умений
          </td>
        </tr>
        <tr>
          <td>
            Способность применять социально – бытовые умения самостоятельно
          </td>
        </tr>
        <tr>
          <td rowspan="3">
            Сформированность социально-бытовых умений в ближайшем окружении (в
            школе, во дворе)
          </td>
          <td>
            Способность применять социально бытовые умения под руководством
            взрослого школе, во дворе)
          </td>
        </tr>
        <tr>
          <td>
            Способность обращаться за помощью при формировании социально -
            бытовых умений.
          </td>
        </tr>
        <tr>
          <td>
            Способность применять социально – бытовые умения самостоятельно
          </td>
        </tr>
        <tr>
          <td rowspan="3">
            Сформированность социально – бытовых умений в более широкой
            жизненной ориентации (в социуме)
          </td>
          <td>
            Способность применять социально бытовые умения под руководством
            взрослого
          </td>
        </tr>
        <tr>
          <td>
            Способность обращаться за помощью при формировании социально -
            бытовых умений.
          </td>
        </tr>
        <tr>
          <td>
            Способность применять социально – бытовые умения самостоятельно
          </td>
        </tr>
        <tr>
          <td rowspan="8">
            Владение навыками коммуникации и принятыми ритуалами социального
            взаимодействия (т.е. самой формой поведения, его социальным
            рисунком), в том числе с использованием информационных технологий
          </td>
          <td rowspan="3">
            Сформированность навыков коммуникации со взрослыми
          </td>
          <td>
            Способность инициировать и поддерживать коммуникацию со взрослыми
          </td>
        </tr>
        <tr>
          <td>
            Способность применять адекватные способы поведения в разных
            ситуациях
          </td>
        </tr>
        <tr>
          <td>Способность обращаться за помощью</td>
        </tr>
        <tr>
          <td rowspan="3">
            сформированность навыков коммуникации со сверстниками
          </td>
          <td>
            Способность инициировать и поддерживать коммуникацию сверстниками
          </td>
        </tr>
        <tr>
          <td>
            Способность применять адекватные способы поведения в разных
            ситуациях
          </td>
        </tr>
        <tr>
          <td>Способность обращаться за помощью</td>
        </tr>
        <tr>
          <td>владение средствами коммуникации</td>
          <td>
            Способность использовать разнообразные средства коммуникации
            согласно ситуации
          </td>
        </tr>
        <tr>
          <td>адекватность применения ритуалов социального взаимодействия</td>
          <td>
            Способность правильно применить ритуалы социального взаимодействия
            согласно ситуации
          </td>
        </tr>
      </table>
    </section>
  </div>
</template>

<script>
export default {
  name: "Document",
  props: {
    fullName: {
      type: String,
      default: "Павлов Павел Павлович",
    },
  },
  data() {
    return {
      position: "",
      valueOne: [
        {
          id: "v1_1",
          text: "год обучения в образовательной организации;",
        },
        {
          id: "v1_2",
          text: "сведения о семье (социально-бытовые условия, взаимоотношения в семье, отношение к ребенку);",
        },
        {
          id: "v1_3",
          text: "данные о физическом здоровье, двигательном и сенсорном развитии ребенка;",
        },
        {
          id: "v1_4",
          text: "представления об окружающем мире (о себе, ближайшем окружении, природном, растительном, социальном мире)",
        },
        {
          id: "v1_5",
          text: "выводы по итогам оценки.",
        },
      ],
      checkedValueOne: [],

      valueTwo: [
        {
          id: "v2_1",
          text: "психологическую поддержку семьи, консультации по всем вопросам оказания психолого-педагогической помощи ребенку;",
        },
        {
          id: "v2_2",
          text: "просвещение по вопросам воспитания и обучения ребенка-инвалида;",
        },
        {
          id: "v2_3",
          text: "регулярные контакты родителей и специалистов в течение всего учебного года и др.",
        },
      ],
      checkedValueTwo: "",
    };
  },
  computed: {
    printedValueOne() {
      const checkedValues = this.valueOne.filter(
        (e) => this.checkedValueOne.indexOf(e.id) > -1
      );
      return checkedValues;
    },
  },
};
</script>

<style scoped>
.app-document {
  font-family: "Times New Roman", Times, serif;
  font-size: 14pt;
}

h1,
h2,
h3,
h4 {
  text-align: center;
}

ul {
  list-style: none;
}

.head {
  display: flex;
  flex-direction: row-reverse;
}

.head-table {
  width: 50%;
  text-align: left;
  border-collapse: collapse;
}

.head-table tr,
td {
  border: 2px solid black;
  width: 50%;
  padding: 1rem;
}

.table {
  border: 2px solid black;
  border-collapse: collapse;
}

.table td,
tr {
  border: 1px solid black;
}

.table td:nth-child(1) {
  width: 20%;
}
.table td:nth-child(2) {
  width: 20%;
}
.table td:nth-child(3) {
  width: 60%;
}
</style>
