<template>
  <div>
    <section>
      <table>
        <tr>
          <th>
            <p>«Согласовано» с Управляющим советом от ____20____г</p>
            <p>Председатель УС: _______ {{ fullName }} подпись</p>
          </th>
          <th>
            <p>«Утверждено» приказом от ____20____г №_______</p>
            <p>Должность: <input type="text" v-model="position" /></p>
          </th>
        </tr>
      </table>
    </section>

    <section>
      <h1>
        ПОЛОЖЕНИЕ о разработке и реализации специальной индивидуальной программы
        развития обучающегося
      </h1>
    </section>

    <section>
      <h2>I. Цель и основание разработки и реализации СИПР</h2>

      <ol start="1.1">
        <li>
          Широкий диапазон особых образовательных потребностей детей с
          умеренной, тяжелой, глубокой умственной отсталостью, с ТМНР вызывает
          необходимость образования таких обучающихся по индивидуальной
          программе.
        </li>
        <li>
          В соответствии с требованиями ФГОС образования обучающихся с
          интеллектуальными нарушениями и с учетом 2 варианта примерной АООП
          образования обучающихся с интеллектуальными нарушениями
          образовательная организация разрабатывает специальную индивидуальную
          программу развития (далее СИПР) под руководством {{ fullName }} в
          должности {{ position }}.
        </li>
        <li>
          Целью реализации СИПР является обретение обучающимся таких жизненных
          компетенций, которые позволяют ему достигать максимально возможной
          самостоятельности в решении повседневных жизненных задач, обеспечивают
          его включение в жизнь общества на основе индивидуального поэтапного,
          планомерного расширения жизненного опыта и повседневных социальных
          контактов в доступных для него пределах.
        </li>
      </ol>
    </section>

    <section>
      <h1>II. Организация разработки СИПР</h1>
      <ol start="2.1">
        <li>
          При поступлении ребенка в образовательную организацию специалисты
          проводят психолого-педагогическое обследование с целью последующей
          разработки СИПР и создания оптимальных условий ее реализации.
        </li>
        <li>
          На основе результатов психолого-педагогического обследования ребенка,
          проводимого специалистами образовательной организации, составляется
          психолого-педагогическая характеристика ребенка, в которой дается
          оценка его актуального состояния развития и определяется зона
          ближайшего развития обучающегося.
        </li>
        <li>
          Структура характеристики включает:
          <ul>
            <li v-for="item in valueOne" :key="item.id">
              <input
                type="checkbox"
                :name="item.id"
                :value="item.id"
                :id="item.id"
                v-model="checkedValueOne"
              />{{ item.text }}
            </li>
          </ul>
        </li>
        <li>
          Программа сотрудничества специалистов с семьей обучающегося включает
          перечень направлений сотрудничества, мероприятий и форм сотрудничества
          организации и семьи обучающегося, а также частоту и сроки проведения
          мероприятий. Программа сотрудничества специалистов с семьей
          обучающегося предусматривает:
          <ul>
            <li v-for="item in valueTwo" :key="item.id">
              <input
                type="radio"
                :name="item.id"
                :id="item.id"
                :value="item.id"
                v-model="checkedValueTwo"
              />
              <label :for="item.id">{{ item.text }}</label>
            </li>
          </ul>
        </li>
      </ol>
    </section>

    <section>
      <h2>III. Организация реализации СИПР</h2>
      <ol start="3.1">
        <li>
          Реализация СИПР осуществляется группой, в которую входят те же
          специалисты, которые разрабатывали индивидуальную программу развития,
          и родителями (законными представителями) обучающегося.
        </li>
        <li>
          К анализу результатов обучения привлекаются члены семьи обучающегося.
          В ходе аттестации дается согласованная оценка достижений ребёнка в
          сфере жизненных компетенций.
        </li>
      </ol>
    </section>
  </div>
</template>

<script>
export default {
  name: "Document",
  props: {
    fullName: {
      type: String,
      default: "Павлов Павел Павлович",
    },
  },
  data() {
    return {
      position: "",
      valueOne: [
        {
          id: "v1_1",
          text: "год обучения в образовательной организации;",
        },
        {
          id: "v1_2",
          text: "сведения о семье (социально-бытовые условия, взаимоотношения в семье, отношение к ребенку);",
        },
        {
          id: "v1_3",
          text: "данные о физическом здоровье, двигательном и сенсорном развитии ребенка;",
        },
        {
          id: "v1_4",
          text: "представления об окружающем мире (о себе, ближайшем окружении, природном, растительном, социальном мире)",
        },
        {
          id: "v1_5",
          text: "выводы по итогам оценки.",
        },
      ],
      checkedValueOne: [],

      valueTwo: [
        {
          id: "v2_1",
          text: "психологическую поддержку семьи, консультации по всем вопросам оказания психолого-педагогической помощи ребенку;",
        },
        {
          id: "v2_2",
          text: "просвещение по вопросам воспитания и обучения ребенка-инвалида;",
        },
        {
          id: "v2_3",
          text: "регулярные контакты родителей и специалистов в течение всего учебного года и др.",
        },
      ],
      checkedValueTwo: "",
    };
  },
  computed: {
    printedValueOne() {
      const checkedValues = this.valueOne.filter(
        (e) => this.checkedValueOne.indexOf(e.id) > -1
      );
      return checkedValues;
    },
  },
};
</script>

<style scoped>
h3 {
  margin: 40px 0 0;
}
ul {
  list-style-type: circle;
}
ol {
  list-style-type: decimal;
}
li {
  display: inline-block;
}
a {
  color: #42b983;
}
</style>
